# 1. Missing Data & Aggregations

In [2]:
import pandas as pd
import numpy as np

np.random.seed(1337)
size = 8

print(f"{random_matrix.size = }")

random_matrix = np.random.randint(1,10, (size,size))
index = np.random.choice(random_matrix.size, 10, replace=False)      # random värden mellan 0-64, om replace = ("true"), vid replace=False blir dubbletter ok

print(f"{index = }")
print(random_matrix)

# komma åt ett tal, 5,3 x = 5, y = 3, når "5"

random_matrix[5,3] = 999
random_matrix

NameError: name 'random_matrix' is not defined

In [ ]:
from random import random
import pandas as pd
import numpy as np

np.random.seed(1337)
size = 8

print(f"{random_matrix.size = }")

random_matrix = np.random.randint(1,10, (size,size))
index = np.random.choice(random_matrix.size, 10, replace=False)      # random värden mellan 0-64, om replace = ("true"), vid replace=False blir dubbletter ok

print(f"{index = }")
# print(random_matrix)

# komma åt ett tal, 5,3 x = 5, y = 3, når "5"

# random_matrix[5,3] = 999

random_matrix = random_matrix*1.        # converts to int

random_matrix.ravel()[index] = None

random_matrix

random_matrix.size = 64
index = array([28, 42, 17, 49, 53, 31, 35,  2, 13, 62])

array([[ 8.,  9., nan,  8.,  3.,  3.,  5.,  9.],
       [ 7.,  7.,  8.,  9.,  2., nan,  7.,  3.],
       [ 3., nan,  2.,  8.,  4.,  2.,  4.,  4.],
       [ 5.,  9.,  9.,  8., nan,  2.,  7., nan],
       [ 5.,  3.,  6., nan,  5.,  3.,  4.,  3.],
       [ 5.,  9., nan,  4.,  9.,  9.,  8.,  5.],
       [ 4., nan,  2.,  3.,  1., nan,  9.,  3.],
       [ 2.,  1.,  2.,  5.,  3.,  1., nan,  8.]])

In [ ]:
scores = pd.DataFrame(
    random_matrix, 
    index = [f"Player {i}" for i in range(1, size+1)], 
    columns = [f"Round {i}" for i in range(1, size + 1)],
)

scores

,Round 1,Round 2,Round 3,Round 4,Round 5,Round 6,Round 7,Round 8
Player 1,8.0,9.0,NaN,8.0,3.0,3.0,5.0,9.0
Player 2,7.0,7.0,8.0,9.0,2.0,NaN,7.0,3.0
Player 3,3.0,NaN,2.0,8.0,4.0,2.0,4.0,4.0
Player 4,5.0,9.0,9.0,8.0,NaN,2.0,7.0,NaN
Player 5,5.0,3.0,6.0,NaN,5.0,3.0,4.0,3.0
Player 6,5.0,9.0,NaN,4.0,9.0,9.0,8.0,5.0
Player 7,4.0,NaN,2.0,3.0,1.0,NaN,9.0,3.0
Player 8,2.0,1.0,2.0,5.0,3.0,1.0,NaN,8.0

## 1.1 Missing Data

Ta bort data om man har stora mängder, alternativt kan man räkma ut exempelvis medianen och ta ut "simulerad data" Ex NAN för player 8

In [ ]:
scores.isnull() # True when its false, aka true = not a number

,Round 1,Round 2,Round 3,Round 4,Round 5,Round 6,Round 7,Round 8
Player 1,False,False,True,False,False,False,False,False
Player 2,False,False,False,False,False,True,False,False
Player 3,False,True,False,False,False,False,False,False
Player 4,False,False,False,False,True,False,False,True
Player 5,False,False,False,True,False,False,False,False
Player 6,False,False,True,False,False,False,False,False
Player 7,False,True,False,False,False,True,False,False
Player 8,False,False,False,False,False,False,True,False

In [ ]:
scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Player 1 to Player 8
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Round 1  8 non-null      float64
 1   Round 2  6 non-null      float64
 2   Round 3  6 non-null      float64
 3   Round 4  7 non-null      float64
 4   Round 5  7 non-null      float64
 5   Round 6  6 non-null      float64
 6   Round 7  7 non-null      float64
 7   Round 8  7 non-null      float64
dtypes: float64(8)
memory usage: 576.0+ bytes

In [ ]:
scores.dropna() # slänger allt, scores har "not a number" på alla rader

Empty DataFrame
Columns: [Round 1, Round 2, Round 3, Round 4, Round 5, Round 6, Round 7, Round 8]
Index: []

In [ ]:
scores.loc["Player 8"]      # locks player 8, and prints out player 8

Round 1    2.0
Round 2    1.0
Round 3    2.0
Round 4    5.0
Round 5    3.0
Round 6    1.0
Round 7    NaN
Round 8    8.0
Name: Player 8, dtype: float64

In [ ]:
scores.loc["Player 8"]["Round 7"] = 4           # lägger till 4 på round 7

In [ ]:
scores

,Round 1,Round 2,Round 3,Round 4,Round 5,Round 6,Round 7,Round 8
Player 1,8.0,9.0,NaN,8.0,3.0,3.0,5.0,9.0
Player 2,7.0,7.0,8.0,9.0,2.0,NaN,7.0,3.0
Player 3,3.0,NaN,2.0,8.0,4.0,2.0,4.0,4.0
Player 4,5.0,9.0,9.0,8.0,NaN,2.0,7.0,NaN
Player 5,5.0,3.0,6.0,NaN,5.0,3.0,4.0,3.0
Player 6,5.0,9.0,NaN,4.0,9.0,9.0,8.0,5.0
Player 7,4.0,NaN,2.0,3.0,1.0,NaN,9.0,3.0
Player 8,2.0,1.0,2.0,5.0,3.0,1.0,4.0,8.0

In [ ]:
scores.dropna(axis = "columns")     # droppar kolumner
# NaN -> Not a number
# None -> 
# Null -> missing value
# not persistent, "inplace" to mutate

# scores.dropna(axis = "columns", inplace = True) , ändrar värdet

# namge variabler eller mutera orginallet om de ska användas igen

          Round 1  Round 7
Player 1      8.0      5.0
Player 2      7.0      7.0
Player 3      3.0      4.0
Player 4      5.0      7.0
Player 5      5.0      4.0
Player 6      5.0      8.0
Player 7      4.0      9.0
Player 8      2.0      4.0

In [ ]:
scores.fillna(0, inplace = True)        # fills NA , muterad, skriver 0 på alla NAN
scores

,Round 1,Round 2,Round 3,Round 4,Round 5,Round 6,Round 7,Round 8
Player 1,8.0,9.0,0.0,8.0,3.0,3.0,5.0,9.0
Player 2,7.0,7.0,8.0,9.0,2.0,0.0,7.0,3.0
Player 3,3.0,0.0,2.0,8.0,4.0,2.0,4.0,4.0
Player 4,5.0,9.0,9.0,8.0,0.0,2.0,7.0,0.0
Player 5,5.0,3.0,6.0,0.0,5.0,3.0,4.0,3.0
Player 6,5.0,9.0,0.0,4.0,9.0,9.0,8.0,5.0
Player 7,4.0,0.0,2.0,3.0,1.0,0.0,9.0,3.0
Player 8,2.0,1.0,2.0,5.0,3.0,1.0,4.0,8.0

In [ ]:
# CSV , Comma Seperated Values
# survived, test, alive
# 10,1,4

## 1.2 Missing Data - Strategy

In [ ]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

varje kolumn är nyckel till panda series

In [ ]:
type(titanic["survived"])

pandas.core.series.Series

In [ ]:
titanic["survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [ ]:
titanic["survived"].value_counts()      # räknar antalet 0:or och 1:or

0    549
1    342
Name: survived, dtype: int64

In [ ]:
titanic["pclass"].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
titanic["class"].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [ ]:
titanic.describe()      

# numerical columns

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
nans = titanic.isnull()
nans

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [ ]:
nans = titanic.isnull().head()      # head(), första 5 raderna
nans

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [ ]:
nans = titanic.isnull().sum()       # Visar antalet null, missing value 177 ålder. 
nans

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [3]:
sns.histplot(data = titanic, x = "age", hue = "sex", kde=True)      # Konoel Density

NameError: name 'sns' is not defined

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

### 1.3.1 Case

The historian (domain expert) advices us to use median age of corresponding gender to fill in missing ages

In [ ]:
titanic["sex"] == "male"        # true or false if its man or not

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: sex, Length: 891, dtype: bool

In [ ]:
titanic[titanic["sex"] == "male"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
males = titanic[titanic["sex"] == "male"]["age"]    # filterar till alla män, tar sedan ut alla , ger medianen på männ

In [ ]:
median_males_age = titanic[titanic["sex"] == "male"]["age"].median()      # filterar till alla män, tar sedan ut alla , ger medianen på männ
median_females_age = titanic[titanic["sex"] == "female"]["age"].median()

median_males_age, median_females_age        # median age på männ o kvinnor

(29.0, 27.0)

TODO: Use "who" category and find median

In [ ]:
titanic.loc[titanic["sex"] == "male", "age"]   # .loc , locate

0      22.0
4      35.0
5       NaN
6      54.0
7       2.0
       ...
883    28.0
884    25.0
886    27.0
889    26.0
890    32.0
Name: age, Length: 577, dtype: float64

In [ ]:
titanic.loc[titanic["sex"] == "male", "age"].fillna(median_males_age)       # it not a number, recives the median age

0      22.0
4      35.0
5      29.0
6      54.0
7       2.0
       ...
883    28.0
884    25.0
886    27.0
889    26.0
890    32.0
Name: age, Length: 577, dtype: float64

In [ ]:
titanic.loc[titanic["sex"] == "male", "age"] = titanic.loc[titanic["sex"] == "male", "age"].fillna(median_males_age)
titanic.loc[titanic["age"] == 29, "sex"].value_counts()
# titanic.loc[titanic["sex"] == "female", "age"] = titanic.loc[titanic["sex"] == "female", "age"].fillna(median_males_age)

male      137
female     60
Name: sex, dtype: int64

In [ ]:
titanic["age"].isnull().sum()

0

In [ ]:
titanic.loc[titanic["age"].isnull(), "sex"].value_counts()

Series([], Name: sex, dtype: int64)

In [ ]:
titanic["age"] = titanic["age"].fillna(median_females_age)
titanic.isnull().sum()["sex"]

0

In [ ]:
sns.histplot(data = titanic, x = "age", kde = True, hue = "sex", bins = 80)

NameError: name 'sns' is not defined

## 1.4 Aggregations

Summarazing data
- sum()
- mean()
- median()
- max()
- (min)

In [ ]:
titanic.head()

NameError: name 'titanic' is not defined